{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Hey there",
        "Good morning",
        "Good afternoon",
        "Hi there",
        "Greetings",
        "Howdy",
        "Hey",
        "Hiya",
        "What's up",
        "Morning",
        "Afternoon",
        "Yo",
        "Hi Bot",
        "Hello Bot",
        "Hey Bot",
        "Hi there Bot",
        "Hello there Bot",
        "Hey there Bot",
        "Hy GCUF SE Bot",
        "Hy GCUF SE Chatbot",
        "Hy GCUF SE Chat Bot",
        "Hey GCUF SE Chatbot",
        "Hey GCUF SE Chat Bot",
        "Hello GCUF SE Chatbot"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi! How can I help you?",
        "Hey there! How may I assist you?",
        "Hi there! What can I do for you?",
        "Greetings! How may I be of help?",
        "Howdy! How can I assist you today?",
        "Hey! How can I help you?",
        "Hiya! How may I assist you?",
        "What's up? How can I be of service?",
        "Good morning! Is there anything I can assist you with?",
        "Good afternoon! How may I help you?",
        "Yo! How can I assist you today?"
      ]
    },
    {
      "tag": "salam",
      "patterns": [
        "AoA",
        "AOA",
        "Assalam o Alikum",
        "Assalam u Alikum",
        "Salam"
      ],
      "responses": [
        "Walikum u salam! How can I help you?",
        "Wao! How can I assist you today?",
        "WAO! How can I assist you today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye",
        "Bye",
        "See you later",
        "Take care",
        "Catch you later",
        "Till we meet again",
        "Bye-bye",
        "Good by SE Bot",
        "Goodbye SE Bot",
        "Bye SE Bot",
        "See you later SE Bot",
        "Take care SE Bot"
      ],
      "responses": [
        "Goodbye! Have a great day!",
        "Bye! Take care and have a wonderful day!",
        "See you later! If you need any further assistance, feel free to ask.",
        "Take care! Feel free to reach out if you have any more questions.",
        "Bye-bye! If you ever require help, feel free to reach out."
      ]
    },
    {
      "tag": "thank",
      "patterns": [
        "Thank you",
        "Thanks",
        "Appreciate it",
        "Thanks a lot",
        "Jazakallah",
        "Jazakallah Khair",
        "Jazakumullah Khair",
        "Thanks for your help",
        "Thanks for the assistance",
        "Thanks for the guidance",
        "Thank SE Bot",
        "Thanks SE Bot",
        "Thank you SE Bot"
      ],
      "responses": [
        "You're welcome! It's my pleasure to help.",
        "You're welcome! If you need any more assistance, feel free to ask.",
        "You're welcome! I'm here to assist you.",
        "No problem! Let me know if there's anything else I can help with.",
        "You're welcome! It's my pleasure to be of assistance.",
        "You're welcome! If there's anything specific you need, feel free to ask.",
        "You're welcome! I'm here to help whenever you need it.",
        "You're welcome! If there's anything else I can do for you, just let me know.",
        "You're welcome! If you have more questions in the future, I'll be here to answer them."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Can you help me?",
        "I need assistance",
        "I'm stuck, can you assist?",
        "Help me with something",
        "I Need Help Regargind Addmissions",
        "I have a question, can you help?",
        "Can you provide guidance?",
        "Can you offer some help?",
        "I'm confused, can you guide me?",
        "Looking for support, can you assist?",
        "Please help me",
        "Can you help me SE Bot",
        "I need assistance SE Bot"
      ],
      "responses": [
        "Of course! I'm here to help. What do you need assistance with?",
        "Certainly! Please let me know how I can assist you.",
        "I'd be happy to help. What do you need assistance with?",
        "Sure! I'm here to assist you. How can I help?",
        "Absolutely! I'm here to provide guidance on admissions. What specific information do you require?",
        "Sure, I can assist with admissions. Please let me know what you need help with.",
        "No problem! I'm here to help with admissions. What can I assist you with?",
        "I'm here to assist you with admissions-related inquiries. How may I be of help?",
        "Of course, I can provide guidance. Please share your questions or concerns.",
        "I'm here to offer support. Let me know what you need assistance with.",
        "Don't worry, I can help you with any questions you have. Feel free to ask."
      ]
    },
    {
      "tag": "department_information",
      "patterns": [
        "Tell me about the department",
        "Tell me about the software or SE department",
        "What is the department all about?",
        "What is the software or SE department all about?",
        "Can you provide information about the department?",
        "Can you provide information about the software or SE department?",
        "I want to know more about the department",
        "I want to know more about the software or SE department",
        "What is the location of the department?",
        "What is the location of the software or SE department?",
        "Can you provide details about the department?",
        "Can you provide details about the software or SE department?"
      ],
      "responses": [
        "The Software department is located in Yousuf Block Old Campus Faisalabad, providing an ideal atmosphere for learning.",
        "The Software Engineering department offers various undergraduate and postgraduate programs in software engineering.",
        "Our department is dedicated to providing quality education and cutting-edge research in software engineering.",
        "The campus is conveniently located in Yousuf Block Old Campus Faisalabad with easy access to public transportation.",
        "The Software department is equipped with modern classrooms, computer labs, and interactive learning spaces, providing a conducive environment for students to excel in their studies."
      ]
    },
    {
      "tag": "faculty_info",
      "patterns": [
        "Tell me about the faculty",
        "What qualifications do the faculty members have?",
        "Can you provide information about the faculty?",
        "I want to know about the faculty members",
        "Who are the faculty members in the Software Engineering department?",
        "Tell me about the professors in the department",
        "What are the names of the faculty members?",
        "Who are the lecturers in the Software Engineering department?",
        "Can you provide email of the faculty members?",
        "gmail or email of the faculty members?"
      ],
      "responses": [
        "Sure! Here is the information about the faculty members in the Software Engineering department:\n\nName List:\n1. Dr. Muhammad Awais\n2. Dr. Khurram Zeeshan Haider\n3. Dr. Muhammad Sheraz Malik\n4. Dr. M. Yahya Saeed\n5. Engr. Adeel Rifaat Mirza\n6. Nauman-ul-haq\n7. Usama Ahmed\n8. Zubair Nabi",
        "Sure! faculty members in the Software Engineering department:\n\nName List:\n1. Dr. Muhammad Awais - Chairman / Associate Professor\n2. Dr. Khurram Zeeshan Haider - Assistant Professor\n3. Dr. Muhammad Sheraz Malik - Associate Professor\n4. Dr. M. Yahya Saeed - Lecturer\n5. Engr. Adeel Rifaat Mirza - Lecturer\n6. Nauman-ul-haq - Lecturer\n7. Usama Ahmed - Assistant Professor\n8. Zubair Nabi - Lab Engineer",
        "Here are the email addresses of the faculty members in the Software Engineering department:\n\n1. Dr. Muhammad Awais - awais_java@yahoo.com\n2. Dr. Khurram Zeeshan Haider - haider_25@hotmail.com\n3. Dr. Muhammad Sheraz Malik - sheraz_awan@gcuf.edu.pk\n4. Dr. M. Yahya Saeed - m_yahya_saeed@yahoo.com\n5. Engr. Adeel Rifaat Mirza - adeel.mirza@gcuf.edu.pk\n6. Nauman-ul-haq - nauman315@gmail.com\n7. Usama Ahmed - usamaahmed@hotmail.com\n8. Zubair Nabi - zubair.nabi@yahoo.com"
      ]
    },
    {
      "tag": "admission_process",
      "patterns": [
        "How to apply for GCUF Admission?",
        "GCUF Admission process",
        "GCUF Admission procedure",
        "Admission procedure",
        "Steps to apply for GCUF Admission",
        "What are the steps for GCUF Admission?",
        "What are the steps for software Admission?"
      ],
      "responses": [
        "To apply for admission to the Software Engineering program, please visit our university's website and follow the application process outlined for the Department of Software Engineering.",
        "Apply Online at : https://admissions.gcuf.edu.pk/login.php. 1: Create Admission Account. 2: Login to Admission Portal. 3: Check Personal Information.4: Upload Photograph.5: Add Academic Details.6: Add Entry Test Details (if required).7: Select Program(s).8: Proofreading and Application Finalization.9: Fee Voucher."
      ]
    },
    {
      "tag": "admission_required_documents",
      "patterns": [
        "What documents are required for admission?",
        "List of required documents for GCUF admission",
        "Which documents do I need for applying to GCUF?",
        "Can you tell me the documents needed for GCUF admission?",
        "What are the necessary documents for GCUF admission?"
      ],
      "responses": [
        "To apply for admission, you need to submit the following documents, each in 2 copies, attested by a government official:\n\n1. Copies of Academic Documents (Matric, FSc)\n2. Copies of ID Card (Student CNIC)\n3. Copies of BA Form (Bachelor's Degree)\n4. Copies of Domicile (2 copies)\n5. 4 Passport-sized Photographs\n6. Copies of Father's CNIC (2 copies)\n7. Admission Fee Voucher (2 copies)\n8. Admission Form (2 copies)\n9. File Cover (2 copies)\n\nAll documents must be submitted to the department in two sets.\n\nPlease ensure that all documents are properly attested by a government official before submission."
      ]
    },
    {
      "tag": "contact_info",
      "patterns": [
        "How can I contact the department?",
        "What is the department's contact information?",
        "Can you provide me with the department's contact details?",
        "I need to get in touch with the department. How can I do that?",
        "What are the ways to contact the department?",
        "Please give me the contact info for the department."
      ],
      "responses": [
        "You can contact the Software Engineering department at: \n\nAddress: 2nd Floor Yousaf Block, Government College University Faisalabad-Main Campus, Allama Iqbal Road, Faisalabad, Pakistan\nPhone: (041) 9203016\nEmail: se@gcuf.edu.pk\nOffice Hours: Monday to Friday, 9:00 AM to 5:00 PM\n\nFor any inquiries or assistance, please feel free to contact the department during the specified office hours.",
        "You can contact Phone: (041) 9203016\nEmail: se@gcuf.edu.pk\nOffice Hours: Monday to Friday, 9:00 AM to 5:00 PM For any inquiries or assistance, please feel free to contact the department during the specified office hours."
      ]
    },
    {
      "tag": "programs_offered",
      "patterns": [
        "What BS programs does GCUF SE offer?",
        "Tell me about the BSSE programs in GCUF.",
        "Can you provide information about BSSE programs at GCUF?",
        "What MS programs are available at GCUF SE?",
        "Tell me about the MS programs in GCUF SE.",
        "Can you provide information about MS programs at GCUF SE?",
        "Which BS programs are offered in the Software Engineering department?",
        "Tell me about the BS programs in the Software Engineering department.",
        "Can you provide information about BS programs in Software Engineering at GCUF?",
        "Which MS programs are offered in the Software Engineering department?",
        "Tell me about the MS programs in the Software Engineering department.",
        "Can you provide information about MS programs in Software Engineering at GCUF?"
      ],
      "responses": [
        "GCUF offers a wide range of undergraduate (BS) and postgraduate (MS) programs in various disciplines.\n\nFor the Software Engineering department, the following programs are offered:\n\nBS Software Engineering\nMS Software Engineering.\n\nIf you need more information about any specific program, feel free to ask!",
        "For the Software Engineering department, the following programs are offered: BS Software Engineering MS Software"
      ]
    },
    {
      "tag": "fee_structure",
      "patterns": [
        "What is the fee structure for BS morning program?",
        "Tell me about the per-semester fee for BS morning program.",
        "How much is the fee for the BS morning program?",
        "What is the fee structure for BS evening program?",
        "Tell me about the per-semester fee for BS evening program.",
        "How much is the fee for the BS evening program?",
        "What is the fee structure for MS morning program?",
        "Tell me about the per-semester fee for MS morning program.",
        "How much is the fee for the MS morning program?",
        "What is the fee structure for MS evening program?",
        "Tell me about the per-semester fee for MS evening program.",
        "How much is the fee for the MS evening program?"
      ],
      "responses": [
        "The fee structure for BS morning program is approximately 50,000 PKR and evening program is approximately 62,000 PKR per semester.",
        "The fee structure for MS morning program is also around 60,000 PKR and MS evening program, the fee is approximately 72,000 PKR per semester.",
        "For the self or bench fee option in BS or MS evening program, an additional 25,000 PKR is added to the basic fee.",
        "Please note that these figures are approximate and subject to change. For the most accurate and up-to-date information, it is advised to contact the university's finance department."
      ]
    },
    {
      "tag": "last_year_merit",
      "patterns": [
        "What was the merit for last year?",
        "What was the closing percentage for last year?",
        "Tell me about last year's merit",
        "What was the merit of the previous year?",
        "What was the last year's closing merit?"
      ],
      "responses": [
        "The closing merit for last year was 77.27%."
      ]
    },
    {
      "tag": "seat_information",
      "patterns": [
        "How many seats are available on merit in the morning and evening sessions?",
        "Tell me about the seats on merit for morning and evening.",
        "What is the number of seats on merit in the morning and evening?"
      ],
      "responses": [
        "In both the morning and evening sessions, there are approximately 50-60 seats available on merit.",
        "For each session (morning and evening), 50-60 seats are available on merit, and 10 seats are available for self or bench fee."
      ]
    },
    {
      "tag": "eligibility_for_admission",
      "patterns": [
        "What are the eligibility criteria for admission?",
        "Tell me about the admission requirements",
        "What are the qualifications needed for admission?",
        "Can you provide information about the eligibility for admission?",
        "What are the eligibility criteria for admission in Software Engineering?",
        "Tell me about the admission requirements for Software Engineering",
        "What are the qualifications needed for admission in Software Engineering?",
        "Can you provide information about the eligibility for admission in Software Engineering?"
      ],
      "responses": [
        "To be eligible for admission, applicants must meet the following criteria:\n1. For undergraduate programs (BS), candidates should have completed their intermediate education (e.g., FSc, ICS, ICOM) with a minimum of 50% marks from a recognized board.\n2. For postgraduate programs (MS), candidates should have a relevant bachelor's degree with a minimum CGPA of 2.5 or 50% marks from a recognized university.\n3. Entry test results may also be required for certain programs."
      ]
    },
    {
      "tag": "medical_student_eligibility",
      "patterns": [
        "Medical student eligibility in Software Engineering",
        "Can a medical student apply for Software Engineering?",
        "Is Software Engineering open to medical students?",
        "What are the eligibility criteria for medical students in Software Engineering?"
      ],
      "responses": [
        "Yes but  you need to meet the following criteria: 1- FSc Pre-Medical) with a minimum of 60% marks 2- Math Requirements such as Math 1, Math 2, or Calculus  "
      ]
    },
    {
      "tag": "scholarships",
      "patterns": [
        "Tell me about scholarships for Software Engineering students",
        "What scholarships are available for Software Engineering students?",
        "Can you provide information about financial aid and scholarships?",
        "I want to know about scholarships at GCUF for Software Engineering.",
        "Are there any scholarships for Software Engineering students?"
      ],
      "responses": [
        "There are various scholarships available for Software Engineering students, including merit-based scholarships, need-based scholarships, and scholarships for students with disabilities. For more information, please visit the university's website or contact the financial aid office.",
        "1. Ehsaas Scholarship: Government-funded scholarship for deserving students.\n2. HEC Need-Based Scholarship: Supports financially needy students.\n3. Zakat Fund Scholarship: Provides assistance to eligible Zakat recipients.\nVarious other scholarships are available throughout the year. Contact the Financial Aid Office for more information."
      ]
    },
    {
      "tag": "admission_dates",
      "patterns": [
        "When do admissions open for Fall 2023?",
        "What are the admission dates for Fall 2023?",
        "Can you tell me the last date to apply for Fall 2023 admissions?",
        "I want to know about the admission process for Fall 2023.",
        "Where can I apply for Fall 2023 admissions?"
      ],
      "responses": [
        "Admissions for Fall 2023 are now open. The last date to apply is 10th August 2023. You can apply online at https://admissions.gcuf.edu.pk/login.php. For more information, you can contact the Admission Office / Information Cell at 041-9201552 or send an email to admissions@gcuf.edu.pk."
      ]
    },
    {
      "tag": "BS_software_engineering",
      "patterns": [
        "Can you tell me about the BS Software Engineering program?",
        "How long is the duration of the BS Software Engineering program?",
        "I'm interested in the BS Software Engineering program; can you give me some details about it?",
        "Are you able to share insights into what the BS Software Engineering program entails?",
        "Tell me about the BS Software Engineering program.",
        "What is the scheme of studies for BS Software Engineering?",
        "Can you provide information about the majors in the BS Software Engineering program?",
        "What are the major courses in the BS Software Engineering program?",
        "I want to know about the curriculum of BS Software Engineering."
      ],
      "responses": [
        "The BS Software Engineering program is a 4-year undergraduate degree program. The scheme of studies includes various major courses related to software engineering such as Software Design and Architecture, Object-Oriented Programming, Web Development, Database Systems, Operating Systems, and Software Project Management. Students will also study general education courses to develop a well-rounded skillset.",
        "The BS Software Engineering program is a 4-year undergraduate degree that spans across 8 semesters.",
        "The BS Software Engineering program typically takes 4 years to complete, divided into 8 semesters.",
        "Sure! The BS Software Engineering program is a 4-year course consisting of 8 semesters.",
        "The BS Software Engineering program is designed to be completed in 4 years, with a total of 8 semesters.",
        "Yes, 4 years is the standard duration for the BS Software Engineering program, which includes 8 semesters."
      ]
    },
    {
      "tag": "MS_software_engineering",
      "patterns": [
        "Tell me about the MS Software Engineering program.",
        "What is the curriculum of MS Software Engineering?",
        "Can you provide information about the majors in the MS Software Engineering program?",
        "What are the major courses in the MS Software Engineering program?",
        "I want to know about the MS Software Engineering degree."
      ],
      "responses": [
        "The MS Software Engineering program is a postgraduate degree program that typically spans over 1.5 to 2 years.The program includes advanced courses such as Advanced Software Design and Architecture, Software Testing and Quality Assurance, Software Project Management, Artificial Intelligence, Data Science, and Emerging Trends in Software Engineering. Students may also have the option to choose a specialization based on their interests and career goals."
      ]
    },
    {
      "tag": "financial_aid",
      "patterns": [
        "Is there any financial aid or assistance provided?",
        "What options are available for financial support?",
        "Can you guide me on obtaining financial aid?",
        "Tell me about financial aid options at GCUF",
        "What financial assistance is available for students?",
        "Can you provide information about scholarships and financial aid?",
        "I need help with the cost of education. Are there any financial aid programs?",
        "What are the financial support opportunities for students?"
      ],
      "responses": [
        "Yes, the university provides financial aid and assistance to eligible students. This includes grants, loans, work-study programs, and other forms of support.",
        "There are several options for financial support, including need-based aid, merit-based scholarships, and student loans. You can explore these options and determine the ones that suit your circumstances.",
        "To obtain financial aid, you will need to complete the financial aid application and provide the necessary documentation. The university's financial aid office can guide you through the process."
      ]
    },
    {
      "tag": "admission_interview",
      "patterns": [
        "Do I need to appear for an admission interview?",
        "Will there be an interview as part of the admission process?",
        "How can I prepare for the admission interview?",
        "Is there an admission interview for the BS program?",
        "Do I need to appear for an interview for BS admission?",
        "Are there admission interviews for BS candidates?",
        "Tell me about the admission interview process for BS.",
        "Is an interview required for BS admission?"
      ],
      "responses": [
        "For the BS program, there is no admission interview requirement. The admission to the BS program is based on merit, academic qualifications, and other criteria specified by the university.",
        "There are no admission interviews for candidates applying to the BS program. Admissions are solely based on the applicant's academic record and meeting the eligibility criteria.",
        "Applicants for the BS program are not required to appear for an admission interview. The selection process is conducted based on the academic qualifications and merit.",
        "Please note that there is no admission interview process for the BS program. Admission to the BS program is solely based on the applicant's eligibility and meeting the university's requirements.",
        "For BS admission, no interview is conducted. The selection is done based on the applicant's academic achievements and meeting the specified criteria for the program."
      ]
    },
    {
      "tag": "admission_status",
      "patterns": [
        "How can I check my admission status?",
        "Where can I find the merit list for admission?",
        "Is the admission status available online?",
        "How will I know if I have been awarded a seat?",
        "What should I do after my seat is awarded?"
      ],
      "responses": [
        "You can check your admission status by visiting the university's official website and logging into your admission account. The merit list is also available on the website.",
        "The merit list for admission is published on the university's official website. You can find it in the admission section or the notice board.",
        "Yes, the admission status is available online. You can access it by logging into your admission account on the university's website.",
        "If you have been awarded a seat, you will receive a notification through your admission account on the university's website or through an official email or letter.After your seat is awarded, you need to complete the admission process and pay the admission fee within the specified time, usually within 2-3 days, to secure your seat."
      ]
    },
    {
      "tag": "career_opportunities",
      "patterns": [
        "What are the career opportunities available for software engineering graduates?",
        "What career opportunities are available for students in the Software Engineering department?",
        "Can you tell me about job prospects for Software Engineering graduates?",
        "What are the career options after completing a degree in Software Engineering?",
        "How does the department help students in their career development?",
        "Are there any career guidance sessions for students?"
      ],
      "responses": [
        "After completing a degree in Software Engineering, students have diverse career options in the field of software development and technology. They can choose from roles such as Software Engineer, Software Tester, Software Architect, DevOps Engineer, and more.",
        "Software engineering graduates have diverse career opportunities in various industries. They can work as software developers, systems analysts, quality assurance engineers, database administrators, cybersecurity specialists, and more.",
        "The department organizes career development sessions where senior professionals from the industry and alumni share their experiences and insights. These sessions help students understand the industry trends and prepare for their future careers.",
        "Yes, the department conducts career guidance sessions where students can interact with professionals currently working in the industry. Additionally, students are encouraged to participate in online and physical sessions organized by tech societies to learn and work in groups on different tech stacks."
      ]
    },
    {
      "tag": "extracurricular_activities",
      "patterns": [
        "What extracurricular sports activities are available for students?",
        "Tell me about the sports opportunities in the department.",
        "Are there any sports clubs or teams for students?",
        "Can you provide information about the annual sports events?",
        "How can I participate in sports activities at GCUF SE?",
        "Are there any farewell events or functions for graduating students?",
        "Tell me about the annual farewell dinner for students.",
        "What is the matching day event in the Software Engineering department?"
      ],
      "responses": [
        "The Software Engineering department offers various extracurricular sports activities for students, including cricket, football, badminton, and more. Students can join sports clubs and teams to participate in competitions and friendly matches.",
        "We organize annual sports events that include interdepartmental sports competitions and athletic tournaments. Students are encouraged to participate and showcase their sportsmanship skills.",
        "Yes, there are several sports clubs and teams for students, such as the Cricket Club, Football Club, and Badminton Team. Students can join these clubs and participate in regular practices and competitions.",
        "The department hosts various annual sports events, including the Sports Gala, where students compete in different sports and games. It's a great opportunity for students to showcase their talents and teamwork.",
        "To participate in sports activities at GCUF SE, you can join the sports clubs or teams available in the department. Additionally, keep an eye on the department's announcements for upcoming sports events and competitions.",
        "Yes, there are farewell events organized for graduating students. The department hosts a farewell dinner where students, faculty, and staff come together to celebrate the achievements of the graduating class.",
        "The annual farewell dinner is a special event where graduating students are honored, and they have the opportunity to share their experiences and memories. It's a memorable evening filled with joy and nostalgia.",
        "The matching day event in the Software Engineering department is an annual event where students are paired with industry mentors based on their interests and career goals. It helps students establish connections with professionals and gain insights into the industry."
      ]
    }
    
  ]
}